# Brewfile, powered by Homebrew Bundle.
# https://robots.thoughtbot.com/brewfile-a-gemfile-but-for-homebrew
# https://github.com/Homebrew/homebrew-bundle

# Install as a tap:
# `brew tap homebrew/bundle`
# Install everything listed here:
# `brew bundle`

# Meta, for maintaining whitelist.
tap 'homebrew/bundle'
# systemd-esque services
tap 'homebrew/services'
# missing command helper
tap 'homebrew/command-not-found'

# `brew bundle cleanup --dry-run`
# outputs formulae not listed here.

# CLI tools.
brew 'ack'
brew 'bash'
brew 'curl'
brew 'coreutils'
brew 'emacs'
brew 'heroku'
brew 'reattach-to-user-namespace'
brew 'thefuck'
brew 'tmux'
brew 'tree'
brew 'wget'
brew 'yarn'

# VCS.
brew 'git', args: ['with-brewed-curl', 'with-brewed-openssl', 'with-brewed-svn', 'with-gettext', 'with-pcre', 'with-persistent-https']
brew 'git-flow'
brew 'gibo'
brew 'hub'
brew 'legit'
brew 'subversion', args: ['with-perl']
brew 'tig'

# Languages.
brew 'go'
brew 'python'
brew 'ruby'
brew 'node'

# Virtual Machines
brew 'docker'
brew 'docker-machine'
brew 'boot2docker'
brew 'fig'
brew 'docker-compose'

# Databases
brew 'mongodb', args: ['with-openssl']
brew 'redis'
brew 'mysql'
brew 'postgresql'

# Misc.
brew 'd-bus'
brew 'flow'
brew 'jq'
brew 'fortune'
brew 'cowsay'
brew 'mas'

# Dependencies for above.
# While redundant; nice to have whitelisted.
brew 'gdbm'
brew 'gettext'
brew 'libyaml'
brew 'openssl'
brew 'pcre'
brew 'pkg-config'
brew 'readline'
brew 'scons'
brew 'sqlite'
brew 'swig'

# ~-~-~-~-~-~-~-~-~-~-~-~-~-~-~-~-~-~-~-~-~-~-~-~-~-~-~-~-~-~-~-~-~-~-~-~-~-~-~-

# Casks.
# http://caskroom.io/

tap 'caskroom/cask'
tap 'caskroom/versions'
tap 'caskroom/fonts'

# Fonts
cask 'caskroom/fonts/font-dejavu-sans'

# Browsers.
cask 'firefox'
cask 'google-chrome'

# Editors.
cask 'sublime-text'
cask 'lighttable'
cask 'lightpaper'

# Music.
cask 'lastfm'
cask 'spotify'

# Virtual Machines
cask 'virtualbox'
cask 'vagrant'

# Misc.
cask 'bartender'
cask 'xquartz'

# Mac App Store
mas "Amphetamine", id: 937984704
mas "BetterSnapTool", id: 417375580
mas "Gapplin", id: 768053424
mas "GarageBand", id: 682658836
mas "Growl", id: 467939042
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "LastPass", id: 926036361
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "The Unarchiver", id: 425424353
mas "Xcode", id: 497799835
