# Brewfile, powered by brewdler.
# https://robots.thoughtbot.com/brewfile-a-gemfile-but-for-homebrew
# https://github.com/Homebrew/homebrew-brewdler

# Install brewdler as a tap:
# `brew tap Homebrew/brewdler`
# Install everything listed here:
# `brew brewdle`

# Meta, for maintaining whitelist.
tap 'homebrew/brewdler'

# `brew brewdle cleanup --dry-run`
# outputs formulae not listed here.

# CLI tools.
brew 'ack'
brew 'bash'
brew 'curl'
brew 'emacs'
brew 'heroku-toolbelt'
brew 'tree'
brew 'wget'
brew 'thefuck'

# VCS.
brew 'git', args: ['with-brewed-curl', 'with-brewed-openssl', 'with-brewed-svn', 'with-gettext', 'with-pcre', 'with-persistent-https']
brew 'git-flow'
brew 'tig'
brew 'hub'
brew 'gibo'
brew 'subversion', args: ['with-perl']

# Languages.
brew 'go'
brew 'python'
brew 'ruby'

# Browsers.
brew 'phantomjs'
brew 'slimerjs'
brew 'casperjs', args: ['devel']

# Virtual Machines
brew 'docker'
brew 'docker-machine'
brew 'boot2docker'
brew 'fig'

# Databases
brew 'mongodb', args: ['with-openssl']
brew 'redis'

# Misc.
brew 'd-bus'
brew 'flow'
brew 'jq'

# Dependencies for above.
# While redundant; nice to have whitelisted.
brew 'gdbm'
brew 'gettext'
brew 'libyaml'
brew 'openssl'
brew 'pcre'
brew 'pkg-config'
brew 'readline'
brew 'scons'
brew 'sqlite'
brew 'swig'

# ~-~-~-~-~-~-~-~-~-~-~-~-~-~-~-~-~-~-~-~-~-~-~-~-~-~-~-~-~-~-~-~-~-~-~-~-~-~-~-

# Casks.
# http://caskroom.io/

tap 'caskroom/cask'
# brew 'brew-cask'

# Browsers.
cask 'firefox'
cask 'google-chrome'

# Editors.
cask 'lighttable'
cask 'lightpaper'
cask 'mou'

# Music.
cask 'lastfm'
cask 'spotify'

# Virtual Machines
cask 'virtualbox'

# Misc.
cask 'xquartz'
