# Brewfile, powered by Homebrew Bundle.
# https://robots.thoughtbot.com/brewfile-a-gemfile-but-for-homebrew
# https://github.com/Homebrew/homebrew-bundle

# Install as a tap:
# `brew tap homebrew/bundle`
# Install everything listed here:
# `brew bundle`

# Meta, for maintaining whitelist.
tap 'homebrew/bundle'

# `brew bundle cleanup --dry-run`
# outputs formulae not listed here.

# CLI tools.
brew 'ack'
brew 'bash'
brew 'curl'
brew 'emacs'
brew 'heroku'
brew 'tree'
brew 'wget'
brew 'thefuck'
brew 'tmux'
brew 'reattach-to-user-namespace'

# VCS.
brew 'git', args: ['with-brewed-curl', 'with-brewed-openssl', 'with-brewed-svn', 'with-gettext', 'with-pcre', 'with-persistent-https']
brew 'git-flow'
brew 'tig'
brew 'hub'
brew 'gibo'
brew 'subversion', args: ['with-perl']

# Languages.
brew 'go'
brew 'python'
brew 'ruby'

# Virtual Machines
brew 'docker'
brew 'docker-machine'
brew 'boot2docker'
brew 'fig'
brew 'docker-compose'

# Databases
brew 'mongodb', args: ['with-openssl']
brew 'redis'
brew 'mysql'
brew 'postgresql'

# Misc.
brew 'd-bus'
brew 'flow'
brew 'jq'
brew 'fortune'
brew 'cowsay'
brew 'mas'

# Dependencies for above.
# While redundant; nice to have whitelisted.
brew 'gdbm'
brew 'gettext'
brew 'libyaml'
brew 'openssl'
brew 'pcre'
brew 'pkg-config'
brew 'readline'
brew 'scons'
brew 'sqlite'
brew 'swig'

# ~-~-~-~-~-~-~-~-~-~-~-~-~-~-~-~-~-~-~-~-~-~-~-~-~-~-~-~-~-~-~-~-~-~-~-~-~-~-~-

# Casks.
# http://caskroom.io/

tap 'caskroom/cask'
tap 'caskroom/fonts'

# Fonts
cask 'font-dejavu-sans'

# Browsers.
cask 'firefox'
# cask 'google-chrome'

# Editors.
cask 'lighttable'
cask 'lightpaper'

# Music.
cask 'lastfm'
cask 'spotify'

# Virtual Machines
cask 'virtualbox'
cask 'vagrant'

# Misc.
cask 'xquartz'
